StoveSim/static_foam_files/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      mut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    primary_inlet
    {
        type            calculated;
        value           uniform 0;
    }
	secondary_air_LHS
    {
        type            calculated;
        value           uniform 0;
    }
	secondary_air_RHS
    {
        type            calculated;
        value           uniform 0;
    }
	
    outlet_LHS
    {
        type            calculated;
        value           uniform 0;
    }
	outlet_RHS
    {
        type            calculated;
        value           uniform 0;
    }

    stove_body
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
}


// ************************************************************************* //
